In [3]:
import pandas as pd
import numpy as np
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
box_path = "\\Users\\User\\Dropbox\\"

format_dict = {
               'price':'{:.2f}','buy_p':'{:.2f}','sell_p':'{:.2f}','diff':'{:.2f}',
               'ppu':'{:.4f}',
               'net':'{:,.2f}','fee':'{:,.2f}','vat':'{:,.2f}',
               'buy_amt':'{:,.2f}','sell_amt':'{:,.2f}','profit':'{:,.2f}',
               'div_amt':'{:,.2f}','ttl_amt':'{:,.2f}','pct':'{:,.2f}',
               'qty':'{:,}','number':'{:,}','days':'{:,}'
              }
pd.set_option("display.max_rows", None)

cols = 'name ttl_qty buy_amt ppu div_amt buy_date x_date p_date days pct year quarter'.split()
colt = 'name ttl_qty buy_amt ppu div_amt buy_date x_date p_date days pct year quarter number'.split()

In [4]:
name = 'MCS'

### 1ST Batch

In [3]:
div_year = 2016
div_quarter = 4
ids = '284,740,286,287,288,289,290'

In [4]:
sql = '''
SELECT T.name, SUM(qty) AS ttl_qty, 
SUM(B.net) AS buy_amt, MIN(date) AS buy_date
FROM buys B
JOIN stocks T ON B.stock_id = T.id 
WHERE B.id IN (%s)
GROUP BY T.name'''
sql = sql % (ids)
buys = pd.read_sql(sql, conpf)
buys

  name  ttl_qty     buy_amt    buy_date
0  MCS  70000.0  1171589.23  2016-11-11

In [5]:
sql = """
SELECT id, name, year, quarter, number, ppu, net AS div_amt, x_date, p_date
FROM dividends
WHERE name = '%s'
AND ((year = %s AND quarter >= %s) 
OR (year > %s))
ORDER BY name, year DESC, quarter DESC
"""
sql = sql % (name, div_year, div_quarter, div_year)
dividends = pd.read_sql(sql, conpf)
dividends.style.format(format_dict)

In [6]:
df_merge = pd.merge(buys, dividends, on='name', how='inner')
df_merge['div_amt'] = df_merge.ppu * df_merge.ttl_qty
df_merge['days'] = df_merge.p_date - df_merge.buy_date
df_merge['days'] = df_merge['days']/np.timedelta64(1,'D')
df_merge['days'] = df_merge['days'].astype(int)
df_merge['pct'] = round(df_merge['div_amt']/df_merge['buy_amt']*36500/df_merge['days'],2)
df_merge[cols]

,name,ttl_qty,buy_amt,ppu,div_amt,buy_date,x_date,p_date,days,pct,year,quarter
0,MCS,70000.0,1171589.23,0.60,42000.0,2016-11-11,2021-03-15,2021-04-28,1629,0.80,2020,4
1,MCS,70000.0,1171589.23,0.40,28000.0,2016-11-11,2020-08-27,2020-09-10,1399,0.62,2020,2
2,MCS,70000.0,1171589.23,0.40,28000.0,2016-11-11,2020-04-29,2020-04-29,1265,0.69,2019,4
3,MCS,70000.0,1171589.23,0.25,17500.0,2016-11-11,2019-12-04,2019-12-04,1118,0.49,2019,3
4,MCS,70000.0,1171589.23,0.50,35000.0,2016-11-11,2019-04-30,2019-04-30,900,1.21,2018,4
5,MCS,70000.0,1171589.23,0.40,28000.0,2016-11-11,2018-05-07,2018-05-07,542,1.61,2018,1
6,MCS,70000.0,1171589.23,0.20,14000.0,2016-11-11,2017-09-11,2017-09-11,304,1.43,2017,2
7,MCS,70000.0,1171589.23,0.48,33600.0,2016-11-11,2017-05-09,2017-05-09,179,5.85,2016,4

In [7]:
df_grp =df_merge.groupby(['name'])['div_amt'].sum()
div1 = df_grp
div1

name
MCS    226100.0
Name: div_amt, dtype: float64

In [8]:
file_name = 'div-' + name + '.csv'
data_file = data_path + file_name
output_file = csv_path + file_name
box_file = box_path + file_name
data_file, output_file, box_file

('../data/div-MCS.csv',
 '\\Users\\User\\iCloudDrive\\div-MCS.csv',
 '\\Users\\User\\Dropbox\\div-MCS.csv')

In [9]:
df_merge[colt].to_csv(output_file)
df_merge[colt].to_csv(data_file)
df_merge[colt].to_csv(box_file)

### Second batch of purchase

In [13]:
div_year = 2016
div_quarter = 4
second_div_year = 2017
third_div_year = 2018
third_div_quarter = 1
ids = '901'

In [14]:
sql = '''
SELECT T.name, SUM(qty) AS ttl_qty, 
SUM(B.net) AS buy_amt, MIN(date) AS buy_date
FROM buys B
JOIN stocks T ON B.stock_id = T.id 
WHERE B.id IN (%s)
GROUP BY T.name'''
sql = sql % (ids)
buys = pd.read_sql(sql, conpf)
buys

  name  ttl_qty    buy_amt    buy_date
0  MCS  10000.0  167369.89  2017-05-01

In [15]:
sql = """
SELECT id, name, year, quarter, number, ppu, net AS div_amt, x_date, p_date
FROM dividends
WHERE name = '%s'
AND ((year = %s AND quarter = %s) 
OR (year = %s)
OR (year = %s AND quarter = %s))
ORDER BY name, year DESC, quarter DESC
"""
sql = sql % (name, div_year, div_quarter, second_div_year, third_div_year, third_div_quarter)
dividends = pd.read_sql(sql, conpf)
dividends.style.format(format_dict)

In [16]:
df_merge = pd.merge(buys, dividends, on='name', how='inner')
df_merge['div_amt'] = df_merge.ppu * df_merge.ttl_qty
df_merge['days'] = df_merge.p_date - df_merge.buy_date
df_merge['days'] = df_merge['days']/np.timedelta64(1,'D')
df_merge['days'] = df_merge['days'].astype(int)
df_merge['pct'] = round(df_merge['div_amt']/df_merge['buy_amt']*36500/df_merge['days'],2)
df_merge[cols]

,name,ttl_qty,buy_amt,ppu,div_amt,buy_date,x_date,p_date,days,pct,year,quarter
0,MCS,10000.0,167369.89,0.40,4000.0,2017-05-01,2018-05-07,2018-05-07,371,2.35,2018,1
1,MCS,10000.0,167369.89,0.20,2000.0,2017-05-01,2017-09-11,2017-09-11,133,3.28,2017,2
2,MCS,10000.0,167369.89,0.48,4800.0,2017-05-01,2017-05-09,2017-05-09,8,130.85,2016,4

In [17]:
df_grp =df_merge.groupby(['name'])['div_amt'].sum()
div2 = df_grp
div2

name
MCS    10800.0
Name: div_amt, dtype: float64

In [18]:
df_merge[colt].to_csv(output_file,mode='a',header=False)
df_merge[colt].to_csv(data_file,mode='a',header=False)
df_merge[colt].to_csv(box_file,mode='a',header=False)

### Third batch of purchase (must change qty of record 901 to zero)

In [19]:
div_year = 2019
div_quarter = 3
ids = '653'

In [20]:
sql = '''
SELECT T.name, SUM(qty) AS ttl_qty, 
SUM(B.net) AS buy_amt, MIN(date) AS buy_date
FROM buys B
JOIN stocks T ON B.stock_id = T.id 
WHERE B.id IN (%s)
GROUP BY T.name'''
sql = sql % (ids)
buys = pd.read_sql(sql, conpf)
buys

  name  ttl_qty   buy_amt    buy_date
0  MCS   5000.0  83684.95  2019-11-11

In [21]:
sql = """
SELECT id, name, year, quarter, number, ppu, net AS div_amt, x_date, p_date
FROM dividends
WHERE name = '%s'
AND ((year = %s AND quarter >= %s) 
OR (year > %s))
ORDER BY name, year DESC, quarter DESC
"""
sql = sql % (name, div_year, div_quarter, div_year)
dividends = pd.read_sql(sql, conpf)
dividends.style.format(format_dict)

In [22]:
df_merge = pd.merge(buys, dividends, on='name', how='inner')
df_merge['div_amt'] = df_merge.ppu * df_merge.ttl_qty
df_merge['days'] = df_merge.p_date - df_merge.buy_date
df_merge['days'] = df_merge['days']/np.timedelta64(1,'D')
df_merge['days'] = df_merge['days'].astype(int)
df_merge['pct'] = round(df_merge['div_amt']/df_merge['buy_amt']*36500/df_merge['days'],2)
df_merge[cols]

,name,ttl_qty,buy_amt,ppu,div_amt,buy_date,x_date,p_date,days,pct,year,quarter
0,MCS,5000.0,83684.95,0.60,3000.0,2019-11-11,2021-03-15,2021-04-28,534,2.45,2020,4
1,MCS,5000.0,83684.95,0.40,2000.0,2019-11-11,2020-08-27,2020-09-10,304,2.87,2020,2
2,MCS,5000.0,83684.95,0.40,2000.0,2019-11-11,2020-04-29,2020-04-29,170,5.13,2019,4
3,MCS,5000.0,83684.95,0.25,1250.0,2019-11-11,2019-12-04,2019-12-04,23,23.70,2019,3

In [23]:
df_grp =df_merge.groupby(['name'])['div_amt'].sum()
div3 = df_grp
div3

name
MCS    8250.0
Name: div_amt, dtype: float64

In [24]:
df_merge[colt].to_csv(output_file,mode='a',header=False)
df_merge[colt].to_csv(data_file,mode='a',header=False)
df_merge[colt].to_csv(box_file,mode='a',header=False)

### 4th Batch

In [27]:
div_year = 2021
div_quarter = 2
ids = '841'

In [28]:
sql = '''
SELECT T.name, SUM(qty) AS ttl_qty, 
SUM(B.net) AS buy_amt, MIN(date) AS buy_date
FROM buys B
JOIN stocks T ON B.stock_id = T.id 
WHERE B.id IN (%s)
GROUP BY T.name'''
sql = sql % (ids)
buys = pd.read_sql(sql, conpf)
buys

  name  ttl_qty   buy_amt    buy_date
0  MCS   5000.0  83684.95  2021-03-16

In [29]:
sql = """
SELECT id, name, year, quarter, number, ppu, net AS div_amt, x_date, p_date
FROM dividends
WHERE name = '%s'
AND ((year = %s AND quarter >= %s) 
OR (year > %s))
ORDER BY name, year DESC, quarter DESC
"""
sql = sql % (name, div_year, div_quarter, div_year)
dividends = pd.read_sql(sql, conpf)
dividends.style.format(format_dict)

In [30]:
df_merge = pd.merge(buys, dividends, on='name', how='inner')
df_merge['div_amt'] = df_merge.ppu * df_merge.ttl_qty
df_merge['days'] = df_merge.p_date - df_merge.buy_date
df_merge['days'] = df_merge['days']/np.timedelta64(1,'D')
df_merge['days'] = df_merge['days'].astype(int)
df_merge['pct'] = round(df_merge['div_amt']/df_merge['buy_amt']*36500/df_merge['days'],2)
df_merge[cols]

Empty DataFrame
Columns: [name, ttl_qty, buy_amt, ppu, div_amt, buy_date, x_date, p_date, days, pct, year, quarter]
Index: []

In [31]:
df_grp =df_merge.groupby(['name'])['div_amt'].sum()
div4 = df_grp
div4

Series([], Name: div_amt, dtype: float64)

In [ ]:
df_merge[colt].to_csv(output_file,mode='a',header=False)
df_merge[colt].to_csv(data_file,mode='a',header=False)
df_merge[colt].to_csv(box_file,mode='a',header=False)

### End of process

In [6]:
div_year = 2016
div_quarter = 4

In [7]:
sql = """
SELECT id, name, year, quarter, number, ppu, number * ppu AS div_amt, x_date, p_date
FROM dividends
WHERE name = '%s'
AND ((year = %s AND quarter >= %s) 
OR (year > %s))
ORDER BY name, year, quarter
"""
sql = sql % (name, div_year, div_quarter, div_year)
dividends = pd.read_sql(sql, conpf)
dividends.style.format(format_dict)

In [8]:
dividends.div_amt.sum()

245150.0